tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "nektos/tap"
brew "bfg"
brew "binutils"
brew "unbound"
brew "gnutls"
brew "nghttp2"
brew "cask"
brew "dbus"
brew "node", link: false
brew "python@3.10"
brew "emscripten"
brew "exercism"
brew "ext4fuse"
brew "git"
brew "go"
brew "hadolint"
brew "htop"
brew "jq"
brew "kubernetes-cli", link: false
brew "mas"
brew "netlify-cli"
brew "nmap"
brew "node@12"
brew "node@14", link: true
brew "node@16"
brew "nvm"
brew "pigz"
brew "pygments"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "rustup-init"
brew "skopeo"
brew "solidity"
brew "sox"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "truffle"
brew "typescript"
brew "vercel-cli"
brew "wget"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "arduino"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "battle-net"
cask "daisydisk"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "flowdock"
cask "fritzing"
cask "ganache"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "java"
cask "logitech-g-hub"
cask "macfuse"
cask "multipass"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "transmission"
cask "twitch"
cask "ultimaker-cura"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "whatsapp"
cask "xquartz"
cask "zoom"
mas "Paint Pad", id: 575447757