tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "cask"

# Programming languages
brew "node"
brew "npm"
brew "python@3.10"
brew "emscripten"
brew "go"
brew "typescript"
# cask "java"

# Command line utilities
brew "htop"
brew "jq"
brew "nmap"
brew "git"
brew "telnet"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "yq"
brew "stow"
brew "fzf"
brew "sshs"
brew "carapace"
brew "gitmux"
brew "lazygit"
brew "ripgrep"
brew "fd"

# Dev tools
cask "docker"
cask "ngrok"

# maker
cask "arduino"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "insomnia"
cask "ultimaker-cura"

# Apps
cask "battle-net"
cask "daisydisk"
cask "discord"
cask "google-chrome"
tap "homebrew/cask-drivers"
cask "logitech-g-hub"
cask "notion"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "zoom"
cask "whatsapp"
cask "protonvpn"
brew "mas"

# Terminal customizations
brew "pygments"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "karabiner-elements"
