tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "cask"

# Programming languages
brew "nvm"
brew "python@3.10"
brew "emscripten"
brew "go"
brew "typescript"
# cask "java"

# Command line utilities
brew "htop"
brew "jq"
brew "nmap"
brew "git"
brew "telnet"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "yq"

# Dev tools
cask "visual-studio-code"
# cask "dbeaver-community"
cask "docker"
brew "hadolint"
brew "vercel-cli"
cask "multipass"
cask "ngrok"
# cask "virtualbox"
# cask "vmware-fusion"

# maker
cask "arduino"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "fritzing"
cask "insomnia"
cask "ultimaker-cura"

# balena
# brew "kubernetes-cli"
brew "balena-cli"
# brew "minikube"
# brew "netlify-cli"
# brew "skopeo"
# brew "sox"
# cask "flowdock"
# cask "google-cloud-sdk"

# ethereum
brew "solidity"
brew "truffle"
cask "ganache"

# Apps
cask "battle-net"
cask "league-of-legends"
cask "daisydisk"
cask "discord"
cask "google-chrome"
tap "homebrew/cask-drivers"
cask "logitech-g-hub"
cask "notion"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "zoom"
cask "whatsapp"
# cask "transmission"
# cask "twitch"
# cask "vlc"
brew "mas"

# Terminal customizations
cask "iterm2"
brew "pygments"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Misc
# brew "ext4fuse"
# cask "macfuse"