# Programming languages
brew "fnm"
brew "oven-sh/bun/bun"
brew "rustup"

# Command line utilities
brew "fd"
brew "fzf"
brew "gitmux"
brew "ripgrep"
brew "sshs"
brew "stow"
brew "tldr"
brew "tree"
brew "wget"

# OS tools
brew "dockutil"
cask "daisydisk"
cask "karabiner-elements"
cask "logi-options+"
cask "protonvpn"
cask "rectangle"
cask "tailscale-app"

# Terminal
brew "pygments"
brew "tmux"
brew "tpm"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"

# Dev tools
brew "just"
brew "kubernetes-cli"
brew "neovim"
cask "claude-code"
cask "cursor"   
cask "docker-desktop"
cask "gcloud-cli"
cask "insomnia"
cask "ngrok"
cask "pgadmin4"

# Maker
brew "balena-cli"
cask "arduino-ide"
cask "autodesk-fusion"
cask "balenaetcher"
cask "ultimaker-cura"

# Gaming
cask "battle-net"
cask "steam"

# Apps
cask "beeper"
cask "chatgpt"
cask "discord"
cask "google-chrome"
cask "notion"
cask "paintbrush"
cask "slack"
cask "spotify"
cask "zoom"
